#+TITLE: Creating a schema for the OpenAPI Spec
#+PROPERTY: header-args:python :tangle ../openapi.py

** notes
  Download the OpenAPI Spec

#+BEGIN_SRC tmate
    # or set your folder to ~/go/src/k8s.io/kubernetes and ensure you are checked out to master etc
    cd ~/ii/apisnoop_v3
    curl -o swagger.json \
         https://raw.githubusercontent.com/kubernetes/kubernetes/master/api/openapi-spec/swagger.json
#+END_SRC

[[file:../swagger.json]]
https://github.com/TomNomNom/gron

#+BEGIN_SRC shell
curl -L https://github.com/tomnomnom/gron/releases/download/v0.6.0/gron-linux-amd64-0.6.0.tgz \
|  tar xvfzC - ~/go/bin
#|  tar xvfzC - /usr/local/bin
# or:
# go get -u github.com/tomnomnom/gron
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
#+end_EXAMPLE

#+BEGIN_SRC shell
file ~/go/bin/gron
file /usr/local/bin/gron
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
/zfs/home/hh/go/bin/gron: POSIX tar archive (GNU)
/usr/local/bin/gron: cannot open `/usr/local/bin/gron' (No such file or directory)
#+end_EXAMPLE


** make
#+BEGIN_SRC shell
make
#+END_SRC

#+RESULTS:
#+begin_EXAMPLE
./for_each_go_file.sh "gofmt -s -w"
./for_each_go_file.sh "golint -set_exit_status"
./for_each_go_file.sh "goimports -w"
./for_each_go_file.sh "go vet"
goconst ./...
usedexports ./...
errcheck -asserts -ignore '[FS]?[Pp]rint*' ./...
CGO_ENABLED=0 go build -ldflags '-s -w' -o gensql gensql.go
#+end_EXAMPLE


#+BEGIN_SRC sql-mode
select auditid
      ,count(*) as cnt
from audit_events
group by auditid
order by cnt desc limit 10;
#+END_SRC

#+RESULTS:
#+begin_src sql-mode
ERROR:  column "auditid" does not exist
LINE 1: select auditid
               ^
HINT:  Perhaps you meant to reference the column "audit_events.auditID".
#+end_src

